ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_pwm.c
/**
  ******************************************************************************
  * @file    bl606p_pwm.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl606p_pwm.h"
#include "bl606p_glb.h"

/** @addtogroup  BL606P_Peripheral_Driver
 *  @{
 */

/** @addtogroup  PWM
 *  @{
 */

/** @defgroup  PWM_Private_Macros
 *  @{
 */
#define PWMx_Get_Reg_Addr(id)           (PWM_BASE + PWM_CHANNEL_OFFSET + (id) * 0x40)
#define PWM_INT_TIMEOUT_COUNT           (320*1000)
#define PWM_STOP_TIMEOUT_COUNT          (320*1000)



/*@} end of group PWM_Private_Macros */

/** @defgroup  PWM_Private_Types
 *  @{
 */

/*@} end of group PWM_Private_Types */

/** @defgroup  PWM_Private_Variables
 *  @{
 */

/**
 *  @brief PWM interrupt callback function address array
*/
#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *PWMIntCbfArra[PWMx_ID_MAX][PWM_INT_ALL] = {
    {NULL}};
#endif
/*@} end of group PWM_Private_Variables */

/** @defgroup  PWM_Global_Variables
 *  @{
 */

/*@} end of group PWM_Global_Variables */

/** @defgroup  PWM_Private_Fun_Declaration
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static BL_Err_Type PWM_IntHandler(IRQn_Type intPeriph);
#endif

/*@} end of group PWM_Private_Fun_Declaration */

/** @defgroup  PWM_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  PWM interrupt handle
 *
 * @param  None
 *
 * @return SUCCESS
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
static BL_Err_Type PWM_IntHandler(IRQn_Type intPeriph)
{
    uint32_t tmpVal = 0;
    uint32_t maskVal = 0;
    uint32_t PWMx;
    uint16_t intIndex;
    PWMx_ID_Type id;

    for (id = PWM0_ID; id < PWMx_ID_MAX; id++)
    {
        /* Get PWMx start register address */
        PWMx = PWMx_Get_Reg_Addr(id);
        tmpVal = BL_RD_REG(PWMx, PWM_INT_STS);
        maskVal = BL_RD_REG(PWMx, PWM_INT_MASK);
        for (intIndex = 0; intIndex < PWM_INT_ALL; intIndex++)
        {
            if (((1 << intIndex) & tmpVal) && (((1 << intIndex) & maskVal) == 0))
            {
                if (intIndex == PWM_INT_REPT)
                {
                    PWMx_Disable(id);
                }
                BL_WR_REG(PWMx, PWM_INT_CLEAR, 1 << intIndex);
                if (PWMIntCbfArra[id][intIndex] != NULL)
                {
                    PWMIntCbfArra[id][intIndex]();
                }
            }
        }
    }
    return SUCCESS;
}

#endif

/*@} end of group PWM_Private_Functions */

/** @defgroup  PWM_Public_Functions
 *  @{
 */

/****************************************************************************//**
 * @brief  PWMx init
 *
 * @param  id: PWM ID
 * @param  chCfg: PWMx configuration
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type PWMx_Init(PWMx_ID_Type id, PWMx_CFG_Type *cfg)
{
    uint32_t tmpVal;
    uint32_t timeoutCnt = PWM_STOP_TIMEOUT_COUNT;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CLK_TYPE(cfg->clk));
    CHECK_PARAM(IS_PWM_STOP_MODE_TYPE(cfg->stopMode));
    CHECK_PARAM(IS_PWM_EXT_BREAK_POLARITY_TYPE(cfg->extPol));
    CHECK_PARAM(IS_PWM_TRIGADC_SOURCE_TYPE(cfg->adcSrc));

    /* Ungate pwm clock gate */
    GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_PWM);

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG0);
    BL_WR_REG(PWMx, PWM_CONFIG0, BL_SET_REG_BIT(tmpVal, PWM_STOP_EN));
    while(!BL_IS_REG_BIT_SET(BL_RD_REG(PWMx, PWM_CONFIG0), PWM_STS_STOP)){
        timeoutCnt--;
        if(timeoutCnt == 0){
            return TIMEOUT;
        }
    }
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_REG_CLK_SEL, cfg->clk);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_STOP_MODE, cfg->stopMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_EXT_BREAK_PL, cfg->extPol);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_ADC_TRG_SRC, cfg->adcSrc);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_STOP_ON_REPT, cfg->stpRept);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CLK_DIV, cfg->clkDiv);
    BL_WR_REG(PWMx, PWM_CONFIG0, tmpVal);

