ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_pwm.c
void PWM_Channelx_Positive_Break_State_Set(PWMx_ID_Type id, PWM_CHx_Type ch, PWM_Break_State_Type brk)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));
    CHECK_PARAM(IS_PWM_BREAK_STATE_TYPE(brk));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG1);
    switch (ch)
    {
    case PWM_CH0:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_PBS, brk);
        break;
    case PWM_CH1:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_PBS, brk);
        break;
    case PWM_CH2:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_PBS, brk);
        break;
    case PWM_CH3:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_PBS, brk);
        break;
    default:
        break;
    }
    BL_WR_REG(PWMx, PWM_CONFIG1, tmpVal);
}

void PWM_Channelx_Negative_Break_State_Set(PWMx_ID_Type id, PWM_CHx_Type ch, PWM_Break_State_Type brk)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));
    CHECK_PARAM(IS_PWM_BREAK_STATE_TYPE(brk));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG1);
    switch (ch)
    {
    case PWM_CH0:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_NBS, brk);
        break;
    case PWM_CH1:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_NBS, brk);
        break;
    case PWM_CH2:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_NBS, brk);
        break;
    case PWM_CH3:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_NBS, brk);
        break;
    default:
        break;
    }
    BL_WR_REG(PWMx, PWM_CONFIG1, tmpVal);
}

void PWM_Config1_Set(PWMx_ID_Type id, uint32_t cfg)
{
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));

    /* Config pwm config1 */
    BL_WR_REG(PWMx, PWM_CONFIG1, cfg);
}

void PWM_Config1_Get(PWMx_ID_Type id, uint32_t *cfg)
{
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));

    /* Get pwm config1 value */
    *cfg = BL_RD_REG(PWMx, PWM_CONFIG1);
}

void PWM_Channelx_Dtg_Set(PWMx_ID_Type id, PWM_CHx_Type ch, uint8_t dtg)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_DEAD_TIME);
    switch (ch)
    {
    case PWM_CH0:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_DTG, dtg);
        break;
    case PWM_CH1:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_DTG, dtg);
        break;
    case PWM_CH2:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_DTG, dtg);
        break;
    case PWM_CH3:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_DTG, dtg);
        break;
    default:
        break;
    }
    BL_WR_REG(PWMx, PWM_DEAD_TIME, tmpVal);
}

void PWM_SW_Break_Enable(PWMx_ID_Type id)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG0);
    tmpVal = BL_SET_REG_BIT(tmpVal, PWM_SW_BREAK_EN);
    BL_WR_REG(PWMx, PWM_CONFIG0, tmpVal);
}

void PWM_SW_Break_Disable(PWMx_ID_Type id)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG0);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PWM_SW_BREAK_EN);
    BL_WR_REG(PWMx, PWM_CONFIG0, tmpVal);
}

void PWM_EXT_Break_Enable(PWMx_ID_Type id)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWM_CH_ID_TYPE(id));

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG0);
    tmpVal = BL_SET_REG_BIT(tmpVal, PWM_EXT_BREAK_EN);
    BL_WR_REG(PWMx, PWM_CONFIG0, tmpVal);
}

void PWM_EXT_Break_Disable(PWMx_ID_Type id)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWM_CH_ID_TYPE(id));

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG0);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PWM_EXT_BREAK_EN);
    BL_WR_REG(PWMx, PWM_CONFIG0, tmpVal);
}

void PWM_EXT_Break_Polarity_Set(PWMx_ID_Type id, PWM_EXT_Break_Polarity_Type pol)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_EXT_BREAK_POLARITY_TYPE(pol));

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_EXT_BREAK_PL, pol);
    BL_WR_REG(PWMx, PWM_CONFIG0, tmpVal);
}

void PWM_TrigADC_Source_Set(PWMx_ID_Type id, PWM_TrigADC_Source_Type src)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWM_CH_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_TRIGADC_SOURCE_TYPE(src));

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_ADC_TRG_SRC, src);
    BL_WR_REG(PWMx, PWM_CONFIG0, tmpVal);
}

/****************************************************************************//**
 * @brief  Mask/Unmask the PWM interrupt
 *
 * @param  id: PWM ID
 * @param  intType: Specifies the interrupt type
 * @param  intMask: Enable/Disable Specified interrupt type
 *
 * @return None
 *
*******************************************************************************/
void PWM_Int_Mask(PWMx_ID_Type id,PWM_INT_Type intType,BL_Mask_Type intMask)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWM_CH_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_INT_TYPE(intType));

